nguyentri/betaflight/src/platform/RA8/startup/startup_ra8e1.s
/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/

    .weak NMI_Handler
    .thumb_set NMI_Handler,Default_Handler

    .weak HardFault_Handler
    .thumb_set HardFault_Handler,Default_Handler

    .weak MemManage_Handler
    .thumb_set MemManage_Handler,Default_Handler

    .weak BusFault_Handler
    .thumb_set BusFault_Handler,Default_Handler

    .weak UsageFault_Handler
    .thumb_set UsageFault_Handler,Default_Handler

    .weak SecureFault_Handler
    .thumb_set SecureFault_Handler,Default_Handler

    .weak SVC_Handler
    .thumb_set SVC_Handler,Default_Handler

    .weak DebugMon_Handler
    .thumb_set DebugMon_Handler,Default_Handler

    .weak PendSV_Handler
    .thumb_set PendSV_Handler,Default_Handler

    .weak SysTick_Handler
    .thumb_set SysTick_Handler,Default_Handler

    /* External Interrupts */
    .weak ICU_IRQ0_IRQHandler
    .thumb_set ICU_IRQ0_IRQHandler,Default_Handler

    .weak ICU_IRQ1_IRQHandler
    .thumb_set ICU_IRQ1_IRQHandler,Default_Handler

    .weak ICU_IRQ2_IRQHandler
    .thumb_set ICU_IRQ2_IRQHandler,Default_Handler

    .weak ICU_IRQ3_IRQHandler
    .thumb_set ICU_IRQ3_IRQHandler,Default_Handler

    .weak ICU_IRQ4_IRQHandler
    .thumb_set ICU_IRQ4_IRQHandler,Default_Handler

    .weak ICU_IRQ5_IRQHandler
    .thumb_set ICU_IRQ5_IRQHandler,Default_Handler

    .weak ICU_IRQ6_IRQHandler
    .thumb_set ICU_IRQ6_IRQHandler,Default_Handler

    .weak ICU_IRQ7_IRQHandler
    .thumb_set ICU_IRQ7_IRQHandler,Default_Handler

    .weak ICU_IRQ8_IRQHandler
    .thumb_set ICU_IRQ8_IRQHandler,Default_Handler

    .weak ICU_IRQ9_IRQHandler
    .thumb_set ICU_IRQ9_IRQHandler,Default_Handler

    .weak ICU_IRQ10_IRQHandler
    .thumb_set ICU_IRQ10_IRQHandler,Default_Handler

    .weak ICU_IRQ11_IRQHandler
    .thumb_set ICU_IRQ11_IRQHandler,Default_Handler

    .weak ICU_IRQ12_IRQHandler
    .thumb_set ICU_IRQ12_IRQHandler,Default_Handler

    .weak ICU_IRQ13_IRQHandler
    .thumb_set ICU_IRQ13_IRQHandler,Default_Handler

    .weak ICU_IRQ14_IRQHandler
    .thumb_set ICU_IRQ14_IRQHandler,Default_Handler

    .weak ICU_IRQ15_IRQHandler
    .thumb_set ICU_IRQ15_IRQHandler,Default_Handler

    .weak DMAC0_INT_IRQHandler
    .thumb_set DMAC0_INT_IRQHandler,Default_Handler

    .weak DMAC1_INT_IRQHandler
    .thumb_set DMAC1_INT_IRQHandler,Default_Handler

    .weak DMAC2_INT_IRQHandler
    .thumb_set DMAC2_INT_IRQHandler,Default_Handler

    .weak DMAC3_INT_IRQHandler
    .thumb_set DMAC3_INT_IRQHandler,Default_Handler

    .weak DTC_COMPLETE_IRQHandler
    .thumb_set DTC_COMPLETE_IRQHandler,Default_Handler

    .weak DTC_END_IRQHandler
    .thumb_set DTC_END_IRQHandler,Default_Handler

    .weak ICU_SNOOZE_CANCEL_IRQHandler
    .thumb_set ICU_SNOOZE_CANCEL_IRQHandler,Default_Handler

    .weak FCU_FIFERR_IRQHandler
    .thumb_set FCU_FIFERR_IRQHandler,Default_Handler

    .weak FCU_FRDYI_IRQHandler
    .thumb_set FCU_FRDYI_IRQHandler,Default_Handler

    .weak LVD_LVD1_IRQHandler
    .thumb_set LVD_LVD1_IRQHandler,Default_Handler

    .weak LVD_LVD2_IRQHandler
    .thumb_set LVD_LVD2_IRQHandler,Default_Handler

    .weak CGC_MOSC_STOP_IRQHandler
    .thumb_set CGC_MOSC_STOP_IRQHandler,Default_Handler

    .weak LPM_SNOOZE_REQUEST_IRQHandler
    .thumb_set LPM_SNOOZE_REQUEST_IRQHandler,Default_Handler

    .weak AGT0_INT_IRQHandler
    .thumb_set AGT0_INT_IRQHandler,Default_Handler

    .weak AGT0_COMPARE_A_IRQHandler
    .thumb_set AGT0_COMPARE_A_IRQHandler,Default_Handler

    .weak AGT0_COMPARE_B_IRQHandler
    .thumb_set AGT0_COMPARE_B_IRQHandler,Default_Handler

    .weak AGT1_INT_IRQHandler
    .thumb_set AGT1_INT_IRQHandler,Default_Handler

    .weak AGT1_COMPARE_A_IRQHandler
    .thumb_set AGT1_COMPARE_A_IRQHandler,Default_Handler

    .weak AGT1_COMPARE_B_IRQHandler
    .thumb_set AGT1_COMPARE_B_IRQHandler,Default_Handler

    .weak IWDT_UNDERFLOW_IRQHandler
    .thumb_set IWDT_UNDERFLOW_IRQHandler,Default_Handler

    .weak WDT_UNDERFLOW_IRQHandler
    .thumb_set WDT_UNDERFLOW_IRQHandler,Default_Handler

    .weak RTC_ALARM_IRQHandler
    .thumb_set RTC_ALARM_IRQHandler,Default_Handler

    .weak RTC_PERIOD_IRQHandler
    .thumb_set RTC_PERIOD_IRQHandler,Default_Handler

    .weak RTC_CARRY_IRQHandler
    .thumb_set RTC_CARRY_IRQHandler,Default_Handler

    .weak ADC0_SCAN_END_IRQHandler
    .thumb_set ADC0_SCAN_END_IRQHandler,Default_Handler

    .weak ADC0_SCAN_END_B_IRQHandler
    .thumb_set ADC0_SCAN_END_B_IRQHandler,Default_Handler

    .weak ADC0_WINDOW_A_IRQHandler
    .thumb_set ADC0_WINDOW_A_IRQHandler,Default_Handler

    .weak ADC0_WINDOW_B_IRQHandler
    .thumb_set ADC0_WINDOW_B_IRQHandler,Default_Handler

    .weak ADC0_COMPARE_MATCH_IRQHandler
    .thumb_set ADC0_COMPARE_MATCH_IRQHandler,Default_Handler

    .weak ADC0_COMPARE_MISMATCH_IRQHandler
    .thumb_set ADC0_COMPARE_MISMATCH_IRQHandler,Default_Handler

    .weak COMP_HS_0_IRQHandler
    .thumb_set COMP_HS_0_IRQHandler,Default_Handler

    .weak COMP_HS_1_IRQHandler
    .thumb_set COMP_HS_1_IRQHandler,Default_Handler

    .weak USBFS_INT_IRQHandler
    .thumb_set USBFS_INT_IRQHandler,Default_Handler

    .weak USBFS_RESUME_IRQHandler
    .thumb_set USBFS_RESUME_IRQHandler,Default_Handler

    .weak IIC0_RXI_IRQHandler
    .thumb_set IIC0_RXI_IRQHandler,Default_Handler

    .weak IIC0_TXI_IRQHandler
    .thumb_set IIC0_TXI_IRQHandler,Default_Handler

    .weak IIC0_TEI_IRQHandler
    .thumb_set IIC0_TEI_IRQHandler,Default_Handler

    .weak IIC0_ERI_IRQHandler
    .thumb_set IIC0_ERI_IRQHandler,Default_Handler

    .weak IIC1_RXI_IRQHandler
    .thumb_set IIC1_RXI_IRQHandler,Default_Handler

    .weak IIC1_TXI_IRQHandler
    .thumb_set IIC1_TXI_IRQHandler,Default_Handler

    .weak IIC1_TEI_IRQHandler
    .thumb_set IIC1_TEI_IRQHandler,Default_Handler

    .weak IIC1_ERI_IRQHandler
    .thumb_set IIC1_ERI_IRQHandler,Default_Handler

    .weak IIC2_RXI_IRQHandler
    .thumb_set IIC2_RXI_IRQHandler,Default_Handler

