nguyentri/betaflight/src/platform/RA8/startup/startup_ra8e1.s
    .weak IIC2_TXI_IRQHandler
    .thumb_set IIC2_TXI_IRQHandler,Default_Handler

    .weak IIC2_TEI_IRQHandler
    .thumb_set IIC2_TEI_IRQHandler,Default_Handler

    .weak IIC2_ERI_IRQHandler
    .thumb_set IIC2_ERI_IRQHandler,Default_Handler

    .weak SPI0_RXI_IRQHandler
    .thumb_set SPI0_RXI_IRQHandler,Default_Handler

    .weak SPI0_TXI_IRQHandler
    .thumb_set SPI0_TXI_IRQHandler,Default_Handler

    .weak SPI0_TEI_IRQHandler
    .thumb_set SPI0_TEI_IRQHandler,Default_Handler

    .weak SPI0_ERI_IRQHandler
    .thumb_set SPI0_ERI_IRQHandler,Default_Handler

    .weak SPI1_RXI_IRQHandler
    .thumb_set SPI1_RXI_IRQHandler,Default_Handler

    .weak SPI1_TXI_IRQHandler
    .thumb_set SPI1_TXI_IRQHandler,Default_Handler

    .weak SPI1_TEI_IRQHandler
    .thumb_set SPI1_TEI_IRQHandler,Default_Handler

    .weak SPI1_ERI_IRQHandler
    .thumb_set SPI1_ERI_IRQHandler,Default_Handler

    .weak SCI0_RXI_IRQHandler
    .thumb_set SCI0_RXI_IRQHandler,Default_Handler

    .weak SCI0_TXI_IRQHandler
    .thumb_set SCI0_TXI_IRQHandler,Default_Handler

    .weak SCI0_TEI_IRQHandler
    .thumb_set SCI0_TEI_IRQHandler,Default_Handler

    .weak SCI0_ERI_IRQHandler
    .thumb_set SCI0_ERI_IRQHandler,Default_Handler

    .weak SCI0_AM_IRQHandler
    .thumb_set SCI0_AM_IRQHandler,Default_Handler

    .weak SCI0_RXI_OR_ERI_IRQHandler
    .thumb_set SCI0_RXI_OR_ERI_IRQHandler,Default_Handler

    .weak SCI1_RXI_IRQHandler
    .thumb_set SCI1_RXI_IRQHandler,Default_Handler

    .weak SCI1_TXI_IRQHandler
    .thumb_set SCI1_TXI_IRQHandler,Default_Handler

    .weak SCI1_TEI_IRQHandler
    .thumb_set SCI1_TEI_IRQHandler,Default_Handler

    .weak SCI1_ERI_IRQHandler
    .thumb_set SCI1_ERI_IRQHandler,Default_Handler

    .weak SCI1_AM_IRQHandler
    .thumb_set SCI1_AM_IRQHandler,Default_Handler

    .weak SCI2_RXI_IRQHandler
    .thumb_set SCI2_RXI_IRQHandler,Default_Handler

    .weak SCI2_TXI_IRQHandler
    .thumb_set SCI2_TXI_IRQHandler,Default_Handler

    .weak SCI2_TEI_IRQHandler
    .thumb_set SCI2_TEI_IRQHandler,Default_Handler

    .weak SCI2_ERI_IRQHandler
    .thumb_set SCI2_ERI_IRQHandler,Default_Handler

    .weak SCI2_AM_IRQHandler
    .thumb_set SCI2_AM_IRQHandler,Default_Handler

    .weak SCI3_RXI_IRQHandler
    .thumb_set SCI3_RXI_IRQHandler,Default_Handler

    .weak SCI3_TXI_IRQHandler
    .thumb_set SCI3_TXI_IRQHandler,Default_Handler

    .weak SCI3_TEI_IRQHandler
    .thumb_set SCI3_TEI_IRQHandler,Default_Handler

    .weak SCI3_ERI_IRQHandler
    .thumb_set SCI3_ERI_IRQHandler,Default_Handler

    .weak SCI3_AM_IRQHandler
    .thumb_set SCI3_AM_IRQHandler,Default_Handler

    .weak SCI4_RXI_IRQHandler
    .thumb_set SCI4_RXI_IRQHandler,Default_Handler

    .weak SCI4_TXI_IRQHandler
    .thumb_set SCI4_TXI_IRQHandler,Default_Handler

    .weak SCI4_TEI_IRQHandler
    .thumb_set SCI4_TEI_IRQHandler,Default_Handler

    .weak SCI4_ERI_IRQHandler
    .thumb_set SCI4_ERI_IRQHandler,Default_Handler

    .weak SCI4_AM_IRQHandler
    .thumb_set SCI4_AM_IRQHandler,Default_Handler

    .weak SCI9_RXI_IRQHandler
    .thumb_set SCI9_RXI_IRQHandler,Default_Handler

    .weak SCI9_TXI_IRQHandler
    .thumb_set SCI9_TXI_IRQHandler,Default_Handler

    .weak SCI9_TEI_IRQHandler
    .thumb_set SCI9_TEI_IRQHandler,Default_Handler

    .weak SCI9_ERI_IRQHandler
    .thumb_set SCI9_ERI_IRQHandler,Default_Handler

    .weak SCI9_AM_IRQHandler
    .thumb_set SCI9_AM_IRQHandler,Default_Handler

    .weak GPT0_CAPTURE_COMPARE_A_IRQHandler
    .thumb_set GPT0_CAPTURE_COMPARE_A_IRQHandler,Default_Handler

    .weak GPT0_CAPTURE_COMPARE_B_IRQHandler
    .thumb_set GPT0_CAPTURE_COMPARE_B_IRQHandler,Default_Handler

    .weak GPT0_COMPARE_C_IRQHandler
    .thumb_set GPT0_COMPARE_C_IRQHandler,Default_Handler

    .weak GPT0_COMPARE_D_IRQHandler
    .thumb_set GPT0_COMPARE_D_IRQHandler,Default_Handler

    .weak GPT0_COMPARE_E_IRQHandler
    .thumb_set GPT0_COMPARE_E_IRQHandler,Default_Handler

    .weak GPT0_COMPARE_F_IRQHandler
    .thumb_set GPT0_COMPARE_F_IRQHandler,Default_Handler

    .weak GPT0_COUNTER_OVERFLOW_IRQHandler
    .thumb_set GPT0_COUNTER_OVERFLOW_IRQHandler,Default_Handler

    .weak GPT0_COUNTER_UNDERFLOW_IRQHandler
    .thumb_set GPT0_COUNTER_UNDERFLOW_IRQHandler,Default_Handler

    .weak GPT1_CAPTURE_COMPARE_A_IRQHandler
    .thumb_set GPT1_CAPTURE_COMPARE_A_IRQHandler,Default_Handler

    .weak GPT1_CAPTURE_COMPARE_B_IRQHandler
    .thumb_set GPT1_CAPTURE_COMPARE_B_IRQHandler,Default_Handler

    .weak GPT1_COMPARE_C_IRQHandler
    .thumb_set GPT1_COMPARE_C_IRQHandler,Default_Handler

    .weak GPT1_COMPARE_D_IRQHandler
    .thumb_set GPT1_COMPARE_D_IRQHandler,Default_Handler

    .weak GPT1_COMPARE_E_IRQHandler
    .thumb_set GPT1_COMPARE_E_IRQHandler,Default_Handler

    .weak GPT1_COMPARE_F_IRQHandler
    .thumb_set GPT1_COMPARE_F_IRQHandler,Default_Handler

    .weak GPT1_COUNTER_OVERFLOW_IRQHandler
    .thumb_set GPT1_COUNTER_OVERFLOW_IRQHandler,Default_Handler

    .weak GPT1_COUNTER_UNDERFLOW_IRQHandler
    .thumb_set GPT1_COUNTER_UNDERFLOW_IRQHandler,Default_Handler

    .weak GPT2_CAPTURE_COMPARE_A_IRQHandler
    .thumb_set GPT2_CAPTURE_COMPARE_A_IRQHandler,Default_Handler

    .weak GPT2_CAPTURE_COMPARE_B_IRQHandler
    .thumb_set GPT2_CAPTURE_COMPARE_B_IRQHandler,Default_Handler

    .weak GPT2_COMPARE_C_IRQHandler
    .thumb_set GPT2_COMPARE_C_IRQHandler,Default_Handler

    .weak GPT2_COMPARE_D_IRQHandler
    .thumb_set GPT2_COMPARE_D_IRQHandler,Default_Handler

    .weak GPT2_COMPARE_E_IRQHandler
    .thumb_set GPT2_COMPARE_E_IRQHandler,Default_Handler

    .weak GPT2_COMPARE_F_IRQHandler
    .thumb_set GPT2_COMPARE_F_IRQHandler,Default_Handler

    .weak GPT2_COUNTER_OVERFLOW_IRQHandler
    .thumb_set GPT2_COUNTER_OVERFLOW_IRQHandler,Default_Handler

    .weak GPT2_COUNTER_UNDERFLOW_IRQHandler
    .thumb_set GPT2_COUNTER_UNDERFLOW_IRQHandler,Default_Handler

    .weak GPT3_CAPTURE_COMPARE_A_IRQHandler
    .thumb_set GPT3_CAPTURE_COMPARE_A_IRQHandler,Default_Handler

    .weak GPT3_CAPTURE_COMPARE_B_IRQHandler
    .thumb_set GPT3_CAPTURE_COMPARE_B_IRQHandler,Default_Handler

    .weak GPT3_COMPARE_C_IRQHandler
    .thumb_set GPT3_COMPARE_C_IRQHandler,Default_Handler

    .weak GPT3_COMPARE_D_IRQHandler
    .thumb_set GPT3_COMPARE_D_IRQHandler,Default_Handler

    .weak GPT3_COMPARE_E_IRQHandler
    .thumb_set GPT3_COMPARE_E_IRQHandler,Default_Handler

    .weak GPT3_COMPARE_F_IRQHandler
    .thumb_set GPT3_COMPARE_F_IRQHandler,Default_Handler

    .weak GPT3_COUNTER_OVERFLOW_IRQHandler
    .thumb_set GPT3_COUNTER_OVERFLOW_IRQHandler,Default_Handler

    .weak GPT3_COUNTER_UNDERFLOW_IRQHandler
    .thumb_set GPT3_COUNTER_UNDERFLOW_IRQHandler,Default_Handler